app/controllers/users_controller.rb

  def create
  	@user = User.new(user_params)
    yzm = params[:_rucaptcha]
    if verify_rucaptcha?(yzm)
      if @user.save
---
INSERT INTO `users` (`username`, `password_digest`, `created_at`, `updated_at`) VALUES ('orange', '$2a$10$DdKbRkry8Q.X9ZX2dj/Ak.NR6F4tvB4aXEvYUga3l5Qbu2e8xosIG', '2018-07-22 04:07:37', '2018-07-22 04:07:37')

  def sign_in_session
    username = params[:user][:username]
    password = params[:user][:password]
    @user = User.find_by_username(username)
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = '' LIMIT 1